In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}

In [5]:
data1=pd.DataFrame(dict1)

In [7]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [9]:
data1.isnull().sum()
#every column has1 missing value

Names    1
Age      1
City     1
dtype: int64

In [10]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [12]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [13]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'City':[None,'Hyd','Mumbai','Chennai']}
pd.DataFrame(dict2)

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [15]:
data2=pd.DataFrame(dict2)

In [16]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [17]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [18]:
data2.isnull().sum()/len(data2)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [19]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'City':['Null','Hyd','Mumbai','Chennai']}

In [21]:
data3=pd.DataFrame(dict3)

In [22]:
data3.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [24]:
data3.isnull().sum()/len(data3)

Names    0.0
Age      0.0
City     0.0
dtype: float64

**Method-1**

- fill null missing values with random number

- dataframe = data1

- method name:fillna

In [25]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

**Method-2**

- fill the missing values with randon number on specific columns

- dataframe = data1

- method name:fillna

In [27]:
data1['Names'].fillna('Sathish',inplace=True)
data1

     Names   Age     City
0   Ramesh  31.0      NaN
1   Suresh  32.0      Hyd
2  Sathish  33.0   Mumbai
3   Mahesh   NaN  Chennai

In [29]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

**Method-3**

- bfill

- ffill

- pad

- backfill

In [30]:
data1.fillna(method='backfill')
# names index2 is missing value 
# it will replace by index 3 value
# Age at index 3 is missing value va;lue
# but we don't have index4,so the value is NaN
# CITY index 0 has missing value 
# it will replace with index 1 value

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [31]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [32]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [34]:
data1.fillna(method='bfill')

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

- bdill and backfill are same

- pad and ffill are  same

**Method-4**

- mean

- median

- mode

In [35]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [38]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [39]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [40]:
# insted of providing a random numn=ber 
# we are filling with mean of the data

In [42]:
age_median=data1['Age'].median()
age_median

32.0

In [43]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [45]:
age_mode=data1['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [46]:
data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3     NaN
Name: Age, dtype: float64

  **METHOD-5**

- KNN=K nearest neighbours

- in the KNN insted of taking mean of all the values

- will choose neighbours data 

- will take those mean only

**KNN imputer**

- n_neighbours is parameter can be user
- if we donnot choose by default it will take as =5

In [57]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [54]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

**Method-6**

- based on other columns 

- some times all above methods will not provide good justification

- at that times we need to check other columns dependancy also

- most of the time will pick a column which have highest correlation